; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v11 ?v12)
             (pred_1 ?v2 ?v6)
             (pred_5 ?v11 ?v6)
             (pred_3 ?v1 ?v11 )
	     (pred_4 ?v11)
             (pred_9 ?v8)
             (pred_8 ?v2)
             (pred_11 ?v6)
             (pred_7 ?v11)
             (pred_2 ?v2)
             (pred_12 ?v11)
             (pred_10 ))



(:action op_1
:parameters (?v10 ?v3 ?v7 ?v13)
:precondition (and (pred_9 ?v10) (pred_9 ?v3) (pred_8 ?v7) (pred_11 ?v13)
          (pred_6 ?v10 ?v3) (pred_1 ?v7 ?v13)
                   (pred_5 ?v3 ?v13) (pred_4 ?v10) 
                   (pred_7 ?v3) (pred_2 ?v7))
:effect (and  (pred_12 ?v3) (not (pred_7 ?v3))))


(:action op_3
:parameters (?v10 ?v4)
:precondition (and (pred_9 ?v10) (pred_9 ?v4)
               (pred_4 ?v10) (pred_6 ?v10 ?v4) (pred_12 ?v4))
:effect (and (pred_4 ?v4) (not (pred_4 ?v10))))

(:action op_4
:parameters (?v10 ?v7)
:precondition (and (pred_9 ?v10) (pred_8 ?v7) 
                  (pred_4 ?v10) (pred_3 ?v7 ?v10) (pred_10 ))
:effect (and (pred_2 ?v7)
   (not (pred_3 ?v7 ?v10)) (not (pred_10 ))))


(:action op_5
:parameters (?v10 ?v9 ?v5)
:precondition (and (pred_9 ?v10) (pred_8 ?v9) (pred_8 ?v5)
                  (pred_4 ?v10) (pred_2 ?v5) (pred_3 ?v9 ?v10))
:effect (and (pred_2 ?v9) (pred_3 ?v5 ?v10)
        (not (pred_2 ?v5)) (not (pred_3 ?v9 ?v10))))

(:action op_2
:parameters (?v10 ?v7)
:precondition (and (pred_9 ?v10) (pred_8 ?v7) 
                  (pred_4 ?v10) (pred_2 ?v7))
:effect (and (pred_10 ) (pred_3 ?v7 ?v10) (not (pred_2 ?v7)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_12 obj_11 obj_05 obj_16 obj_18 obj_13 obj_04 obj_14 obj_20 obj_19 obj_21 obj_06 obj_15 obj_17 obj_03 obj_09
    obj_02 obj_10
    obj_07 obj_08 obj_01
    )

    (:init
       (pred_10)

       (pred_9 obj_12)
       (pred_9 obj_11)
       (pred_9 obj_05)
       (pred_9 obj_16)
       (pred_9 obj_18)
       (pred_9 obj_13)
       (pred_9 obj_04)
       (pred_9 obj_14)
       (pred_9 obj_20)
       (pred_9 obj_19)
       (pred_9 obj_21)
       (pred_9 obj_06)
       (pred_9 obj_15)
       (pred_9 obj_17)
       (pred_9 obj_03)
       (pred_9 obj_09)
       (pred_11 obj_02)
       (pred_11 obj_10)
       (pred_8 obj_07)
       (pred_8 obj_08)
       (pred_8 obj_01)

       (pred_6 obj_12 obj_18)
       (pred_6 obj_12 obj_11)
       (pred_6 obj_11 obj_13)
       (pred_6 obj_11 obj_05)
       (pred_6 obj_11 obj_12)
       (pred_6 obj_05 obj_04)
       (pred_6 obj_05 obj_16)
       (pred_6 obj_05 obj_11)
       (pred_6 obj_16 obj_14)
       (pred_6 obj_16 obj_05)
       (pred_6 obj_18 obj_20)
       (pred_6 obj_18 obj_13)
       (pred_6 obj_18 obj_12)
       (pred_6 obj_13 obj_19)
       (pred_6 obj_13 obj_04)
       (pred_6 obj_13 obj_11)
       (pred_6 obj_13 obj_18)
       (pred_6 obj_04 obj_21)
       (pred_6 obj_04 obj_14)
       (pred_6 obj_04 obj_05)
       (pred_6 obj_04 obj_13)
       (pred_6 obj_14 obj_06)
       (pred_6 obj_14 obj_16)
       (pred_6 obj_14 obj_04)
       (pred_6 obj_20 obj_15)
       (pred_6 obj_20 obj_19)
       (pred_6 obj_20 obj_18)
       (pred_6 obj_19 obj_17)
       (pred_6 obj_19 obj_21)
       (pred_6 obj_19 obj_13)
       (pred_6 obj_19 obj_20)
       (pred_6 obj_21 obj_03)
       (pred_6 obj_21 obj_06)
       (pred_6 obj_21 obj_04)
       (pred_6 obj_21 obj_19)
       (pred_6 obj_06 obj_09)
       (pred_6 obj_06 obj_14)
       (pred_6 obj_06 obj_21)
       (pred_6 obj_15 obj_17)
       (pred_6 obj_15 obj_20)
       (pred_6 obj_17 obj_03)
       (pred_6 obj_17 obj_19)
       (pred_6 obj_17 obj_15)
       (pred_6 obj_03 obj_09)
       (pred_6 obj_03 obj_21)
       (pred_6 obj_03 obj_17)
       (pred_6 obj_09 obj_06)
       (pred_6 obj_09 obj_03)
       (pred_7 obj_04)
       (pred_7 obj_09)
       (pred_7 obj_20)
       (pred_5  obj_04 obj_02)
       (pred_5  obj_09 obj_10)
       (pred_5  obj_20 obj_10)
       (pred_12 obj_12)
       (pred_12 obj_11)
       (pred_12 obj_05)
       (pred_12 obj_16)
       (pred_12 obj_18)
       (pred_12 obj_13)
       (pred_12 obj_14)
       (pred_12 obj_19)
       (pred_12 obj_21)
       (pred_12 obj_06)
       (pred_12 obj_15)
       (pred_12 obj_17)
       (pred_12 obj_03)

       (pred_1  obj_07 obj_02)
       (pred_1  obj_08 obj_10)
       (pred_1  obj_01 obj_10)
       (pred_3 obj_07 obj_11)
       (pred_3 obj_08 obj_14)
       (pred_3 obj_01 obj_06)
       (pred_4 obj_13)
    )

    (:goal (and
       (pred_3 obj_08 obj_11)
    ))
(:constraints
  (always (not (pred_4 obj_05)))
)
)

; plan
1. (op_3 obj_13 obj_19)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_19)
   goals met: 0 of 1
2. (op_3 obj_19 obj_21)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_21)
   goals met: 0 of 1
3. (op_3 obj_21 obj_06)
   deleted: (pred_4 obj_21)
   added: (pred_4 obj_06)
   goals met: 0 of 1
4. (op_3 obj_06 obj_14)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_14)
   goals met: 0 of 1
5. (op_4 obj_14 obj_08)
   deleted: (pred_3 obj_08 obj_14) (pred_10)
   added: (pred_2 obj_08)
   goals met: 0 of 1
6. (op_3 obj_14 obj_06)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_06)
   goals met: 0 of 1
7. (op_3 obj_06 obj_21)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_21)
   goals met: 0 of 1
8. (op_3 obj_21 obj_19)
   deleted: (pred_4 obj_21)
   added: (pred_4 obj_19)
   goals met: 0 of 1
9. (op_3 obj_19 obj_13)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_13)
   goals met: 0 of 1
10. (op_3 obj_13 obj_11)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_11)
   goals met: 0 of 1
11. (op_5 obj_11 obj_07 obj_08)
   deleted: (pred_2 obj_08) (pred_3 obj_07 obj_11)
   added: (pred_2 obj_07) (pred_3 obj_08 obj_11)
   goals met: 1 of 1
